{
  "https://docs.capillarytech.com/": {
    "title": "Capillary Documentation",
    "chunks": [
      "Capillary Documentation\nCapillary Documentation Hub\nWelcome to the Capillary Documentation Hub! Here, you'll discover a world of resources to help you unleash the power of our innovative products and solutions. From expert tips to advanced features, we've got everything you need to make the most out of your Capillary experience. Ready to explore? Let's dive in!\nUser Documentation\nLoyalty+\nEncourage repeat business, offer rewards and boost your customer relationships with personalized loyalty programs\nEngage+\nBuild relationships at every interaction & Personalise your engagement with omnichannel marketing solutions\nInsights+\nLeverage the customer data with the right KPIs and metrics & analyze your data to get the best profitable insights out of it.\nCapillary Data Platform\nAn effective platform to unlock critical data insights, ingests data from multiple soures and helps companies make sense of their data\nDeveloper Documentation\nGet started with APIs\nKnow the basics of Capillary APIs and make your first API request\nCapillary SDK\nKnow how to integrate Capillary iOS and Android SDKs\nMore\nRelease notes\nCapillary Academy\nCapillary Blog\nCapillary Website\nTickets\nNewsletters"
    ]
  },
  "https://docs.capillarytech.com/reference/introduction": {
    "title": "Example use case",
    "chunks": [
      "Ask AI\nExample use case\nRewards catalog is a platform where brands can create rewards that the customers can purchase against their loyalty points. Rewards could be points, coupons, gift vouchers, cart promotions, or products from third-party vendors.\nTypes of Rewards\nVoucher\n: Digital or physical discount codes and coupons.\nGift Card\n: Prepaid cards with monetary value for specific retailers.\nPhysical Reward\n: Tangible products requiring physical fulfillment.\nPoints\n: Loyalty points as purchasable rewards.\nMiles\n: Miles from airline or partner programs for conversion.\nCharity\n: Charitable donations using points or cash.\nSweepstakes\n: Contest entries for prize draws.\nAuction\n: Bidding-based rewards.\nCash Wallet\n: Direct monetary credits to digital wallets.\nFree Voucher\n: Complimentary items.\nUse Case: Sweepstakes Rewards"
    ]
  },
  "https://docs.capillarytech.com/reference/authentication": {
    "title": "Authentication",
    "chunks": [
      "Ask AI\nAuthentication\nThis page provides you information regarding the authentications used in API Capillary APIs.\nCapillary supports three types of authentication:\nOAuth\nThis auth flow is used when the API requests are made from a program or service running on a server. This flow uses an access token to authenticate an API request. You can enable oAuth from InTouch as mentioned in the respective section below.\nBasic auth\nThis is used where POS terminals are directly integrated with Capillary server. This flow uses Till ID and MD5 hash encoded password to authenticate an API request. Find more details in the section below.\nAuthentication for end-customer web and mobile apps\nThis is used for end-customer authentication where you want end-customers to login to a mobile or web application built on Capillary CDP.\n📘\nIt is mandatory to use only store-specific Till/Store Center credentials as API response depends on this identification.\nWhen to use Basic & OAuth?\nAuthentication Type\nDescription\nBasic\nCan be used for POS integrations where API requests come to the Capillary server directly from POS front end or POS store server.\noAuth\nShall be used for backend integrations (from one backend to another backend). For example, POS integrations where API requests come to the Capillary server from an API gateway or a central server; FTP integrations where backend service needs to be authenticated; 3rd party integration where API requests come to Capillary from a backend platform.\nAuthentication scenarios and recommended authentication\nScenario\nDescription\nAuthentication\nPOS client-to-server integration\nPOS terminals are directly integrated with Capillary server. API requests come directly from POS terminal to the Capillary Server.\nBasic authentication using till username and password\nPOS server-to-server integration\nPOS servers are directly integrated with Capillary Server.  API requests come directly from POS server to the Capillary Server.\noAuth2 client credentials flow using API key and secret\nFTP server-to-server integration\nClient  systems are configured to  Push files to an FTP and Capillary access the is  and Capillary will access and process files from FTP. (process - Via connect+ or OOB solution).\noAuth2 client credentials flow using API key and secret\nServer-to-server custom integration\nClient server will consume capillary API via. wrapper service. Development and maintenance is subjective to the deal.\noAuth2 client credentials flow using API key and secret\nPrebuilt server-to-server integrations (Magento, Shopify, SFMC connectors)\nIn this, client-systems would consume Capillary Plugin to communicate with Capillary.\noAuth2 client credentials flow using API key and secret\nEnd customer apps integration\nThese are third-party apps and consumes Mobile APIs and Gateway APIs to communicate with Capillary.\nMobile APIs auth service,\nusing\nusername & password/otp;\ntill username & password\nCustom & non-standard (non oAuth2 or OIDC) authorization\nNo social login options supported\nEnd-customer IAM (CIAM) in Partner Apps\nEnable clients of Capillary’s direct customers to be able to access data in the Capillary Platform. Allow users to use the Customer’s login credentials to provide access to the 3rd Party clients to access data on behalf of the customer.\nOAuth 2.0 Authorization Code Flow and SSO"
    ]
  },
  "https://docs.capillarytech.com/reference/customer": {
    "title": "Customer (V1)",
    "chunks": [
      "Ask AI\nCustomer (V1)\nA customer is an individual who purchases goods/services, or subscribes to the organization’s newsletters. An organization refers to a store, business firm, hospital or restaurant.\nBased on the registration status, customers are categorized into three types:\nLoyalty customers: Customers who have registered into the organization’s loyalty program\nNon-loyalty customers: Customers who have subscribed (mobile number or email id) to organization’s newsletter to receive campaign/transaction messages but not enrolled into the organization’s loyalty program\nNot-interested or anonymous customers: Customers who have neither enrolled in the loyalty program nor subscribed to the organization’s newsletter\nThe customer entity contains APIs related to registering customers into the loyalty program, managing loyalty accounts and updating subscription status of both registered and non-registered customers. It stores customer related information such as identifiers, profile details, custom field details, transactions, preferences, subscription details (mobile number/email id), tier details, points history and coupons history.\nCustomer APIs allow you to do the following -\nRegister customers into your organization’s loyalty program\nUpdate loyalty customers’ profile information\nUpdate primary or secondary identifiers (mobile no, email id, or external id)\nRetrieve customer details of loyalty and non-loyalty customers\nCapture complaints and feedback of loyalty customers\nAdd, update and retrieve customer preferences of loyalty customers\nRetrieve transactions of loyalty/non-loyalty customers\nResponse Codes\nSuccess Codes\nCode\nDescription\n1000\nCustomer registered successfully.\nCustomer retrieved successfully.\nSubscription updated successfully.\nSubscription retrieved successfully\nCustomer updated successfully.\nCoupons retrieved successfully.\nCustomer notes added/updated successfully\nCustomer notes retrieved successfully\nCustomer preferences retrieved successfully.\nCustomer preferences updated successfully.\n1000\nReferral statistics retrieved successfully\nReferrals are invited successfully\n1040\nCustomer id change request has submitted successfully\n1061\nCustomer recommendations fetched successfully\n1052\nTransactions fetched successfully\n1300\nTicket retrieved successfully\nTicket added successfully\nError Codes\nCode\nDescription\n500\nAll requests failed due to errors.\n400\nInput is invalid. Please check request parameters or input xml/json; No identifier provided to get loyalty users.\n618\nNot allowed - customer is marked as fraud.\n816\nCustomer not found for organization.\n1001\nUnable to register. Invalid mobile number\n1002\nUnable to register. Invalid email id\n1003\nUnable to register. Invalid external id\n1004\nFailed to populate store\n1006\nUnable to register. Mobile number is required\n1007\nUnable to register customer. No valid primary identifier mobile number, email ID, or external ID passed.\n1008/ 1038\nUnable to register with external id\n1009\nUnable to add registered customer to MLM\n1010\nUnable to update loyalty points of the customer\n1011\nCannot find customer for provided identifier\n1012\nCannot find customer with the provided mobile number/external ID/e-mail ID.\n1013\nCustomer is not registered for the loyalty Program.\n1014\nCustomer is registered already\n1015\nNo identifier provided to get loyalty users\n1016\nUnable to register. Email provided already exists for some other user\n1017\nProvided Custom Field is invalid\n1018\nUnable to update custom field\n1019\nMobile number or external id is required along with the email Id to register\n1020\nThe customer is not registered for loyalty program\n1021\nInvalid validation code\n1023\nUnable to register customer to loyalty program\n1024\nUnable to update customer profile\n1025\nMandatory fields are not matching for customer identity update\n1026\nCount of optional fields match is less than required\n1027\nField name provided for verification is invalid\n1028\nNo customer notes are available\n1029\nUnable to retrieve customer preferences\n1030\nUnable to update customer preferences\n1031\nNo preferences set for this customer\n1032\nA customer already exists with the same mobile number\n1033\nA customer already exists with the same external id\n1034\nUnable to register. Registration date is not within the allowed past or future date limit.\n1035\nUnable to update few customer preferences\n1036\nOne or more notes could not be added/updated for customer.\n1037\nUnable to add/update customer notes\n1039\nUnable to register. Email ID is required.\n1041\nCustomer id change request failed\n1042\nInvalid mobile no/email id/external id\n1043\nUnable to register. Customer’s external id is required.\n1044\nYou do not have sufficient permission to view the customer details\n1045\nNo valid identifier (mobile/email) passed for non-loyalty customer.\n1046\nConversion of loyalty customer to non-loyalty is not allowed\n1047\nCustomer's primary identifier not matching with other identifiers\n1048\nCustomer’s email id is required to convert to loyalty customer\n1049\nCustomer’s external id is required to convert to loyalty customer\n1051\nNo transactions or recommendations found for the customer\n1053\nPreferred store specified is not found.\n1060\nBatch limit exceeded\n1062\nInvalid Test & Control Status\n1086\nPoints processing failed\n1087\nPoints processing failed\n1088\nUnable to issue points. Please report to capillary support\n1089\nPoints processing failed\n1090\nPoints processing failed\n1091\nPoints processing failed\n1092\nPoints processing failed\n1093\nPoints processing failed\n1094\nPoints processing failed\n1095\nPoints processing failed\n1096\nPoints processing failed\n1097\nPoints processing failed\n1098\nPoints processing failed\n1099\nPoints processing failed\n1101\nInvalid channel type\n1102\nInvalid priority type\n1103\nInvalid scope\n1104\nInvalid identifier or no identifier passed\n1105\nMultiple scopes are not allowed\n1106\nInvalid subscription status passed\n1107\nInvalid campaign id passed\n1108\nInvalid outbox id passed\n1109\nUnable to add, update or fetch subscription details.\n1150\nInvalid store ID passed.\n1110\nUnable  to update subscription details\n1222\nInternal error occurred with the referral system\n1202\nInvalid campaign token\n1203\nInvalid campaign configured\n1204\nThe customer may not be eligible for the referral program.\n1205\nUnable to find the referrer in the specific campaign\n1206\nFailed to add referral. Referral type is not supported.\n1222\nInternal error occurred with the referral system\n1301\nA ticket already exists with the same subject\n1302\nTicket registration failed\n1303\nTicket subject should not be empty\n10001\nFailed to add customer.\n10002\nFailed to update customer details.\n91001\nFailed to get point details.\n91002\nFailed to get subscription details.\n91003\nValidation failed.\n91004\nFailed to get segmentation details.\n91005\nis Primary Key,\ncannot be updated.\n91006\nupdate is not allowed.\n91007\nis already occupied by some other user, ignoring it.\n91009\nRetrieved survivor account for the requested merge victim.\n91010\nDowngrade strategy is not configured.\n91011\nCustomer is already in the lowest slab.\n91012\nCustomer is already in the highest slab.\n91013\nCall to Points Engine for tier upgrade criteria has failed\n.\n91014\nCall to Points Engine for tier renewal criteria has failed\n.\n91015\nFailed to update extended fields; or field length too long\n.\n91016\nWECHAT profile is not available for the customer.\n91017\nWEB_ENGAGE profile is not available for the customer.\n91018\nUnable to load WeChat notifications.\n91019\nUnable to load Web Engage notifications.\n91020\nInvalid TILL passed for registration.\n91021\nInvalid attribution TILL passed.\n91022\nFailed to update subscription for\nchannel and priority"
    ]
  },
  "https://docs.capillarytech.com/docs/onboard-users-to-intouch": {
    "title": "Onboard users to Intouch",
    "chunks": [
      "Onboard users to Intouch\nThis page provides you with information on the Onboarding users to Intouch.\nThis template enables you to onboard users in bulk to Intouch with the following attributes:\nUser role\nEntities to which the user has access\nUser type\nSecurity / Access groups to which the user has access\n📘\nNote\nThis is applicable only for external users and cannot be used to add Capillary users.\nConfiguring the template\nTo configure the template, perform the below steps/actions:\nIn the\nConnect-to-source\nBlock\n, enter the source server details where the source\ndata is present and the location for saving the processed file. See\nConnect to source\n.\nIn the\nDecrypt data\nblock, if the files are encrypted, enter the details to decrypt the data. See\nDecrypt data\n.\nIn the\nData-Validation-Block\n, validate or transform data using a Databricks notebook. For more details, refer to\nData-Validation-Block\n. The block is optional, so you can skip it without affecting the dataflow. If enabled, the rest of the dataflow continues as usual after the block executes.\nIn the\nTransform Data\nblock, map the API fields with the source CSV file. See\nTransform data\n. The below parameters are mandatory:\nParameter\nDescription\nfirstName\nName of the user.\nreportsTo\nThe email ID of the existing user to whom the user reports. You can also map all users whom you are onboarding to a single user.\nemail\nEmail ID of the user.\nuserRole\nRole of the user. Enter a valid role defined for this org in\nIntouch > Organization setup > Roles & Privileges\n. The API throws an error if the role entered does not belong to the user's org. This determines the level of data access the user has. For example, a concept-level role indicates that the user will have access to concept-level data.\naccessibleEntities\nEntities to which the user will have access. If the role is concept-level, the org units to which the user will have access are defined and separated by a comma. Example - orgunit1, orgunit2. This is not required if the user role is organisation level where the user will have access to entire org-level data.\nuserType\nDefines the user type. The supported values are Brand User, Brand User - Reports Only, and Brand POC.\n*Brand POC**(Administrator) - A brand POC is a type of user who can add other users, and approve or reject the addition of users.\n*Brand user** (Standard user) - A brand user is a type of user in the system who cannot add new users or approve or reject existing users but they can configure or publish the campaigns according to their user permission.\n*Brand user - reports only **- A brand user - reports only is a type of user that will not be able to access the inTouch platform but will get insights plus report notifications, which they can click on and view.\ngroupName\nAccess group/Security group name to which the user will be assigned. This access group name should match with the access group name created in the Organizational Security Groups. The access groups are defined in\nOrganisation settings > Security & Audit > Access\n.\n*Note: ** For groupName and permission-related information, contact the access team for access.\nIn the\nConnect-to-destination\nblock, enter the API endpoint details. See\nConnect to destination\n.\nFor this template, the API used is\n. By default, this block is auto-filled and need not be modified.\nIn the\nTrigger section\nblock, enter the details to schedule the trigger. Refer to the documentation on scheduling\nTrigger\n.\nUpdated\n4 months ago\nAsk AI"
    ]
  },
  "https://docs.capillarytech.com/docs/customer_overview": {
    "title": "Customer overview",
    "chunks": [
      "Customer overview\nIn Member Care, you can view profile information, customer status, subscription details, interactions, transactions, and other loyalty details of a customer. This section provides information on how to access customer details and update specific information from Member Care.\nTo view the overview of customer details:\nLog on to InTouch and navigate to\nMember Care\n.\nFrom the drop-down in\nSearch\n, select\nCustomers.\nIn the search box, enter the complete customer identifier such as registered mobile number, email ID, external ID, card number, card external ID, or name, and from the search result list select the customer profile.\nBy default, the application displays the\nOverview\ntab. The\nOverview\ntab displays the basic details of the customer. This page is also called Customer Single View (CSV).\nTo know more details about the customer click the\nLoyalty\n,\nEvents\n,\nIncentives\n, and\nCommunications\ntabs.\nOverview\nThe overview tab contains below details:\nNo.\nTitle\n1\nSource profile\n2\nCustomer status and name\n3\nCustomer identifiers\n4\nCommunication channels\n5\nCustomer attributes\n6\nCustomer stats\n7\nStore details\n8\nActive Coupons\n9\nRecent transactions\n10\nCustomer segments\nSource profiles\nThis page shows the customer registration sources in multiple tabs. Capillary supports different sources such as InStore, Facebook, Webengage, WeChat (China-specific), mobile app websites, Line, TMALL, E-commerce sites, WhatsApp, and more.\nBy default, InStore is set as the default source. There are also sources such as Mobile Push, Facebook, and WeChat that can have multiple accounts within the org. You can see the customer details from each account of the source.\nFor example, in the above image, you can see numbers on top of the profile icons. The number 3 on the Whatsapp icon means that the customer has profiles from three WhatsApp accounts of the org. You can click on the Whatsapp icon and choose between one of the three profiles that you want to see.\nCustomer status and name\nThis section shows the current status (custom status label or fraud status) of the customer, the name, and the date when the customer registered. The customer status setting is not by default enabled for an org, its enabled only on a request from the Success team.\nAll orgs might not have Customer Status enabled. Hence, you would see Fraud Status (default enabled) for orgs that have not enabled Customer Status. The\nFraud Status\nis the legacy version of\nCustomer Status\n.\nFraud status contains predefined values (MARKED, CONFIRMED, NOT_FRAUD, RECONFIRMED, INTERNAL), unlike Customer label which contains user-defined values (called custom labels).\nThis remains blank when Both Customer Status and Fraud Status are not set for the customer.\nYou can also see the Status card available in the overview tab.\nHere you can see the following statuses of the customer:\nLoyalty status\n: Displays the loyalty status. For example, Loyal.\nTest & control status\n: You can also change the current group of customers from test to control or vice versa. Click on the more options icon > Change test and control status > In\nChange to\n, set the new status.\nCustomer status code\n:  Defines the current customer status in the Capillary system.\nCustomer status label\n: Defines the customer status.   To change the customer status label, click on the more options icon >\nChange customer status label\n>\nChange to\n, choose the new status >\nReason\n, type the reason or notes for updating the status label > Click\nSave\n.\n👍\nNote\nFrom June 2024, the customer status feature will be enabled by default for new organizations.\nGroup details\n❗️\nThis is applicable only to customers who are part of a hierarchy. See\nMember hierarchy\nfor more details.\nThe section shows below details:\nThe number of groups the customer belongs to\nCustomer's contribution towards the group\nGroup lifetime spend\nCompany name and role of the member in the group\nYou can click the download icon and download the total list of groups the customer belongs to.\nCompany group\nCustomer identifiers\nThis section shows the registered identifiers of the customer. The first identifier is the primary identifier of the org and the remaining are the supported secondary identifiers. Member Care supports mobile numbers, email ID, external ID, card number, card external ID, WeChat union ID, and more. However, you will see only org-supported identifiers\nBy default, it shows up to three identifiers. To view more identifiers, click\nShow more\n.\nMember hierarchy\n❗️\nThis is applicable only for customers who are part of a company group.\nFor members who are part of a company/non-family & friends group, you can click the hierarchy icon and view the member hierarchy. For more information on hierarchy, see\nMember hierarchy\n.\nThe member hierarchy page displays the member hierarchy with their primary identifier. You can search for a member and also click on the\nDownload\noption to download the member list.\nCommunication channels\nThis shows the communication channels associated with each source profile. Click on the drop-down to expand. Each source can have multiple communication channels. A customer can have different identifiers for a channel across sources.\nThe section\nReachable on\nshows the communication channels that are available for the customer. For example, if a customer has logged in to the org's app, we capture the Android or iOS device ID. A mobile push icon will be shown. Similarly, if a user has shared his/her email address, we will show the e-mail icon.\n📘\nThe Communication channels section shows blank when no information is available. This happens especially when customer has registered using card number or external  ID without providing any communication details.\nActive coupons\nShows the list of active coupons available for the customer. Use the horizontal scroll options to toggle between different coupons available. You will see the code and the applicable discount for each coupon.\nRecent transactions\nThis section shows the recent transactions of the customer. You will see the transaction date, transaction number, points issued, points redeemed, and the type of transaction - Regular, Return, or Mixed. Use the horizontal scroll options to toggle between different transactions available.\nTo view complete details of each transaction or access recent transactions, click\nView all\n.\nCustomer attributes\nThis shows the custom field and extended field details captured for the customer. The names shown in the screenshot may differ for each org depending on what was created or enabled for your org.\nCustom fields are denoted with a blue dot.\nStore details\nThis shows the store-related information of the customer such as registered TILL, recently transacted store, date and time of the recent transaction, and preferred store (store code).\nYou can also change the preferred store of the customer. To change click the more options icon >\nChange preferred store\n. You will see the current store and an option to change the store.\nIn\nChange to\n, choose the new preferred store and click\nSave\n.\nBehavioural stats\nThis shows the key metrics of the customer transactions such as:\nLifetime purchase\nAverage transaction value\nTotal transactions\nAverage basket size\nFrequency of visit\nEarn-burn ratio\nCoupon redemption rate\nReferrals made\nSegments\nCustomer Segmentation is a logical grouping of audiences based on shared characteristics. Segments are used to tailor the marketing efforts of brands effectively. Segmentation is usually done based on demographics or customer behavior. Member Care shows the list of segments that the customer is in. These segments were created on Insights+. You can see the segment value of the customer in each segment.\nTo view segment details, click\nView all\n. You can search for a specific segment using the Search box.\nGroups\n❗️\nThis is only applicable if customer is part of any group.\nDisplays the details of groups the customer belongs to. You can also click the download icon and download the group details.\nSubscription status\nThis section allows you to view and set the subscription status of a customer.\nTo view the subscription status, click on the desired source profile > select the org from the drop-down > select the channel.\nTo set the subscription status,\nSelect the source > org and click on the three dots.\nSelect the channel.\nTo enable or disable the promotional subscription status, click the\nPromotional status\ntoggle switch.\nTo enable or disable the transactional subscription status, click the\nTransactional status\ntoggle switch.\nClick\nSave\n.\nCards\nYou can view the details of each active card of the customer. To toggle between different cards,  either use the horizontal scroll options or the drop-down box.\nTo view the loyalty details of a specific card, click on the card or select the card from the drop-down.\nLink card\nTo link a card,\nOn the\nCards\nsection, click the three dots menu.\nIn the\nCard number\nfield, enter the card number that you want to link.\nClick\nCheck availability\nto check the availability of the card.\nFrom the\nCard label\ndrop-down, select\nACTIVE\n. Only ACTIVE labels can be assigned to the cards issued from here.\nClick\nSave\n.\nTo configure card issual settings and OTP validation, refer\nCard issual settings\n.\nIssue card\nTo issue a card,\nFrom the\nSelect card series\ndrop-down, select the card series.\nFrom the\nCard label\ndrop-down, select\nACTIVE\n. Only ACTIVE labels can be assigned to the cards issued from here.\nIf OTP validation is enabled for the org, enter the OTP received.\nClick\nIssue\n.\nChange card status & label\nTo change the status and label of a card,\nOn the\nCards\nsection, click the three dots menu.\nFrom the\nCard number\ndrop-down, select the card number for which you want to change the status and label.\nFrom the\nNew card status & label\n, select the card status and label.\nClick\nSave\n.\n📘\nNote\nYou cannot configure any restrictions/blocking actions for customers based on the card status.\nUpdated\nabout 2 months ago\nAsk AI"
    ]
  },
  "https://docs.capillarytech.com/docs/trackers": {
    "title": "Trackers",
    "chunks": [
      "Trackers\nTracker is a powerful tool to track custom values over a specific period. You can use trackers for\nEligibility\nand\nRenewal\nstrategies and also in\nWorkflows\nfor certain milestones. The custom values are **bill amount, gross bill amount, line-item count, line-item quantity, line item price, **and\ncustomer visits\n. You can create tracker strategies and define rule sets based on these custom values.\n📘\nNote\nTrackers are executed based on the TILL time but not based on the time specified for a transaction.\nCreating Trackers\nYou can set transaction event trackers by following these steps.\nOn\nIntouch\n, navigate to\nLoyalty+\n>\nPrograms\n.\nIn\nPrograms\n, select the program you want to edit.\nClick\nEdit Program\nand select\nTrackers\n.\nClick\nAdd Trackers\n.\nIn\nName\n, enter the tracker name.\nIn\nTracked entity\n, select any of the following entities that you want to track\nEntity\nDescription\nTransaction amount\nCreate tracker cases based on the net transaction amount (with discount). For example, if the gross bill amount is $120 and the discount is $20, the (net) bill amount is $100.\nTransaction discount\nCreate tracker cases based on the discount amount of a transaction.\nTransaction gross amount\nCreate tracker cases based on the gross transaction amount (without discount). For example, if the net bill amount is $100 after a discount of $20, the gross bill amount is $120.\nTransaction total quantity\nCreate tracker cases based on the total quantity of all line items purchased during the tracker period. For example, if a customer makes 10 transactions with 20 line items of quantity 3 each in 90 days, then the bill total quantity is 60.\nLine-item amount\nCreate tracker cases based on the purchase value of individual line items.\nLine-item count\nCreate tracker cases based on the number of line items purchased. For example, a customer can have 10 transactions for 20 days where the line items are 200.\nLine-item quantity\nCreate tracker cases based on the number of line items purchased. For example, a customer can have 10 transactions with 22 line items for 90 days. The number of line items purchased could be 50.\nCustomer visits\nCreate tracker cases based on the count of unique bills of a customer.\nPoints\nCreate tracker cases based on the number of points earned during the tracking period.\nTransaction extended field\nCreate tracker cases on a transaction-level extended field. You can use extended fields with datatypes Integer or Double.\nLine-item extended field\nCreate tracker cases on a transaction line-item-level extended field. You can use extended fields with datatypes Integer or Double.\nIn the\nTracking Method\n, select any of the following methods to track entities.\nMethod\nDescription\nMoving Window\nIn Moving Window mode, when a customer makes a transaction, the tracker condition is checked for the previous X days or months (number of days or months set in\nTrack for ___ days/months\n) until the transaction date.\nBased on the cycle in which a transaction falls, the tracker cases are evaluated from starting of that cycle until the transaction date. Consider the following examples:\nMoving window (days):\nA tracker was set up on April 5, 2025, to reward 200 bonus points if a customer spends $1000 within a 20-day period. For each transaction, the system looks back 20 days to calculate the total spend. So, for a purchase made on April 7, the tracker checks spend from March 18 to April 7. For a purchase on May 4, it checks from April 15 to May 4, and so on.\nThis means the window shifts with every transaction, and the set of transactions included in the calculation can change daily.\nMoving window (months):\nA tracker was set up on April 5, 2025, to reward 200 bonus points if a customer spends $1000 within a 1-month period. With month-based logic, the system includes full calendar months in the tracker window and will always start from the 1st of the previous month. So, if purchases are made on March 10th and April 10th, the system considers the spends from March 1st to April 30th. If another purchase is made on May 1st, the window shifts forward—dropping March—and now includes April 1st to May 31st. This approach ensures more stable and predictable tracking by updating only once per month.\nTo track from the start of the same month, enter the value of\nTrack for ___\nas\n. For example, if a purchase is made on 10th April 10th, and\nTrack for ___\n=\n, the system considers spend from April 1st to April 30th.\nCyclic Window\nIn Cyclic Window mode, when a customer makes a transaction for the first time after the tracker is configured, cycles of equal intervals are created for that customer based on the transaction date. The duration of each cycle depends on the value set in\nTrack for ___ days\n.\nBased on the cycle in which a transaction falls, the tracker cases are evaluated from starting of that cycle until the transaction date. Consider the following example:\nA tracker was created on Apr 5, 2019, with a condition to reward a bonus of 200 points on a transaction of $1000 in 20 days (\nTrack for ___ days\n).\nAssume that a customer makes subsequent transactions on Apr 7, May 4, 10, and 22.\n- In Cyclic Window mode, based on the first transaction date (Apr 7) of the customer (after the strategy is configured), cycles are created with equal intervals of 20 days each.For the first transaction ( Apr 7) the condition is checked only for that day. As the second transaction falls in Cycle 2 (May 4), the condition is checked from starting of the second cycle until the transaction day (Apr 27 - May 4). Similarly, the fourth transaction falls in Cycle 3 and the condition is checked from May 27 - May 22.\nCalendar Based Cyclic Window\nCycles of calendar months are created based on the Start Date and the number of months set irrespective of the transaction date.\nFor example, if a Calendar based Cyclic Window is created with the start date Apr 5 and the number of months 3, then the cycles are created for three calendar months as shown in the illustration below. Then, based on the date of the transaction, the corresponding cycle will be considered.\nTier Change Window\nCalculates tracker values considering the last tier change date. For example, if a customer's tier changed on Aug 2, 2020, tracker values will be calculated from Aug 2, 2020, until the current date.\n📘\nNote\nTrackers need to be incorporated in Workflows to define when they need to be evaluated and what happens when the milestone conditions are met.\nIn\nCase Name\n, enter the name for the current tracker case.\nUnder\nTrack For\n, enter the duration of the window to evaluate the tracker case.\nSelect a\nUnit\nfrom the dropdown menu, choosing between months or days.\nIn\nWhat are the tracker's milestones\n, select any of the following options for two fields and enter the desired value.\nDefine the condition of that tracker case in this field. For example, if the Sum of transactions in\n365 days\nare\nEqual to$1000\n.\nField 1\n:\nOption\nDescription\nSum\nIt is the total of tracked entity values for the specified duration.\nFor example for Bill Amount, the sum is the total value of all transactions (amount) tracked for a set duration.\nCount\nIt is the number of times the entity is tracked in a specified duration.\nFor example, for Bill Amount, the count is the number of transactions tracked for a specified time period.\nField 2\n:\nOption\nDescription\nEqual to\nThe condition becomes true if the Sum or Count is the same as the configured value\nGreater than\nThe condition becomes true if the Sum or Count is more than the configured value.\nLess than\nThe condition becomes true if the Sum or Count is less than the configured value.\nGreater than or Equal to\nThe condition becomes true if the Sum or Count is either equal to or more than the configured value.\nLess than or Equal to\nThe condition becomes true if the Sum or Count is either equal to or less than the configured value.\nMod of\nBetween\nThe condition becomes true if the Sum or Count falls between the two configured values.\nEnable\nLimit No. of forwards per customer\nand enter the value to limit the execution of the current tracker case.\n📘\nNote\nOnce the case is executed successfully for X times for a customer (where X is the value specified in this field), the tracker case will not be evaluated for that customer again.\nYou can add multiple tracker cases by clicking\nAdd Tracker Case\n.\nClick\nSave\n.\n📘\nNote\nYou can see the configured tracker case in\nPreview\n.\nEditing a Tracker\nTo edit a tracker, follow these steps:\nIn the Intouch homepage, go to\nLoyalty+\n>\nPrograms\n.\nIn\nPrograms\n, scroll down and select the program you want to edit.\nClick\nEdit Program\nand scroll down to the\nTrackers\nsection.\nClick\nTrackers\n, select the menu button next to the tracker you want to edit, and choose\nEdit\n.\nMake the necessary changes and select\nSave\n.\nThe tracker is now edited successfully.\n📘\nNote\nWhen editing the name or case name for a tracker, update the same name under the tracker sets and point tracker sets under the\nworkflow section\nif used.\nAdding Trackers in Workflows\nOnce you create a tracker strategy, it is important to configure rule sets to start tracking entities set in tracker strategies, evaluate tracker cases, and trigger actions upon successful execution of tracker cases.\nTo configure tracker-based rules, go to the\nWorkflows\npage and select\nMakes a transaction\n(Transaction Add) customer activity (It is usually going to be the activity selected by default).\nThe first parent set (Set1) is for new transaction activity, the second one is the TrackerSet where you can define rules on tracker cases. The last parent set is for the transaction finished activity.\nWhen a transaction is made, the first set is invoked and forwards to the second set. The second set validates all the trackers and executes actions based on the rules and actions configured. The event then gets forwarded to the third set which completes the transaction event.\nTo create tracker based rules, do the following\n:\nOn the\nEventsView\npage, choose\nTransactionAdd\nevent and navigate to TrackerSet.\nClick\n+Condition\n.\nLeave\nExpression\nand\nExpression equals\nto true.\nIn the\nWhen\nfield, click + and select the default\nForward to\nSet action using **+Add action **> Click\nSave\n>\nEnable transaction item\n> Click\nSave\n.\nA new tracker is created under the TrackerSet as shown above. The tracker name is generated by default. You cannot modify the tracker name. You can tag a tracker strategy to the tracker. Tag a tracker strategy to the tracker as explained in the following.\nNavigate to the child tracker set. In the\nWhen\ncondition click + and Select the\nTracker Evaluation\naction and click Save.\nIn\nAdd tracker evaluation action\n, choose the tracker case for which you want to configure rules.\nIn\nTrackers\n(Action field), choose the tracker strategy that you want to tag for the tracker and click\nSave\n.\nSimilarly, you can create multiple child tracker sets under the parent set. To know how to configure rules, see\nConfiguring Events\n.\nUsing Trackers in Tiers\nTrackers offer very powerful means of controlling tier eligibilities and renewal conditions based on recency, for example, you can upgrade a customer based on visits in the last 1 year or purchases in a calendar month and renew based on purchases made as part of Gold Tier.\nTo setup:\nSelect “Tracker” as part of Eligibility criteria or Renewal Conditions.\nYou will also be required to select a ‘Tracker Case’, however this is only for the purpose of the tracking duration - the values for eligibility or renewal are as per the values set in the tier strategy and not the milestones.\nYou will still need to include the Tracker and properly set it up inside workflows for the values to be evaluated and the the tier upgrades to work smoothly\n📘\nNote\nIt is recommended that “Tier Change Window” type trackers are used for Renewal in most cases\nMilestone based Loyalty using Trackers\nYou can setup the Loyalty Program to be able to celebrate milestones as part of the customer’s journey in the Loyalty Program or during certain seasonal time periods. For example, you can award a coupon to a customer if they make 5 visits within the first year of membership or 500 bonus points to a customer on shopping for $1000 once they reach the Gold Tier.\nTo setup, you can create the milestones  by setting up all 4 steps inside the Tracker as explained above. You can then set the appropriate actions inside the different Tracker Case rulesets.\n📘\nNote\nOne Tracker can have multiple milestones\nPoints Allocation inside Trackers\nWhen you allocate points inside trackers, using the percentage allocation method, whatever is the tracked entity becomes the source value.\nUpdated\n3 months ago\nAsk AI"
    ]
  },
  "https://docs.capillarytech.com/docs/insights_overview": {
    "title": "Overview",
    "chunks": [
      "Overview\nThis pages helps with you an overview on Insights+.\nWhat is Insights+ and how can you leverage it?\nCapillary’s Insights+ is an effective business intelligence tool that offers a 360-degree analysis of an organization's business data. With Insights+ capabilities you can measure metrics such as the revenue impact of your marketing campaigns, loyalty program and much more to effortlessly optimize future performance.\nLeveraging such insights can\nHelp you drive product innovation.\nTrack and improve the impact of product launches in real-time.\nAccelerate business outcomes across the lifecycle.\nDrive loyalty\nMake smart, quick and informed decisions with data-driven insights.\nWhere does Insights+ lie with respect to Loyalty+, Engage+ and CDP?\nInsights+ essentially consumes data from  your Loyalty+, Engage+ and CDP platforms to magically transform it into useful data insights. Further, it provides multiple capabilities for you to visualize and analyze your data effectively so that you can take smart, quick and informed decisions to optimize your business performance.\nWhat are the building blocks of Insights+ ?\nThe nascent data in Insights+ transforms into KPIs ,dimensions , charts and then finally into reports. KPIs are _\nKey Performance Indicators\n_and gives a\nquantifiable measure of performance\n. Eg Total bill Amount . Now upon the KPI you can apply\nDimensions\nwhich are essentially\nattributes\nof the  KPIs . Dimensions are used to split the KPI data based on certain attributes and\ncreate charts\n. Insights+ is equipped with over 50 predefined charts and 250 key performance indicators (KPIs).\nA collection of charts is designated as reports on Insights .Refer to the image below to understand the building block of Insights+\nThere are two types of reports available in Insights.\nStandard Reports\n: These are product wise predefined reports created by Capillary which gives you an overview of each product performance\nCustom Reports\n:  Capillary gives you the provision to create personalized reports as per your requirements.\nWhat are the advanced features that Insights+ provides?\nApart from reports, Insights+ provides advanced capabilities such as, Customer Segmentation and Data Exports.\nCustomer Segmentation\nWith the Customer Segmentation feature, you can categorize customers based on their behaviour and demographics. Analytics on these segments will provide deeper insights into customer behaviour, enabling more effective business decisions in terms of pricing, offers and retention strategies. An excellent example of this is RFM RFM (Recency, Frequency, and Monetary) segmentation, which divides customers into segments based on how recently they made a purchase (Recency), how often they purchase (Frequency), and how much they spend (Monetary).\nData Exports\nData Export helps you export the CRM data available in the Capillary's system to an FTP location or internal server. You can export data related to customers, transactions, coupons, points, Footfall, and campaigns. You can create an export job using templates. Each template is a combination of either KPIs or facts, and dimensions.\nUpdated\n4 months ago\nAsk AI"
    ]
  },
  "https://docs.capillarytech.com/docs/configure_event_notification": {
    "title": "Event notification",
    "chunks": [
      "Event notification\nEvent Notifications is a framework that provides near real-time data of events generated in the Capillary System and helps brands subscribe to notifications about particular events.\nOverview\nEvent Notification allows building integrations with Capillary events that originate either through Capillary API (such as customerAdded and transactionAdded)requests or Capillary products such as Loyalty+ (such as pointsIssued and pointsRedeemed), Engage+ or other. Once an event notification is configured, brands can build custom solutions to trigger for pre-configured actions.\nEvent Notifications are sent through Webhooks configured in Capillary Event Notifications. The following is the top-level diagram, of the Events Notification framework (ENS).\nUse Cases\nThere are several use cases of event notifications. A couple of examples are provided in the following.\nEnable PII-less Communication\nIn some cases, brands prefer not to send customers' personally identifiable information (PII data) such as names, email ID, and mobile number to Capillary and manage communication completely at their end. Event Notification can be used to get the events that require communication such as customer registration, transaction, points issual, points redemption, points transfer, etc. On receiving these events, clients can send communication to customers with their names and identifiers as needed.\nIntegration with 3rd Party Applications\nEvent notification can be used to build integrations with 3rd party applications. For example, send a survey link to a customer post transaction event from a survey application such as Medallia; sync customer’s loyalty information to an e-commerce platform such as Magento. Integration can be built to receive real-time events, enrich information using Capillary APIs (if required), and sync it to the 3rd party application using the brand's APIs.\nSteps involved in ENS set up\nThe following are the steps involved in the set up of the Event Notification Service (ENS) for a client.\nWebhook creation\nWebhooks let you create an integration URL that is required to post events data from ENS to Webhook. Before starting with the configuration process, you need to create a Webhook account and generate a URL. The URL is further used to post events generated by the client (This can be done by creating an API proxy for API Gateway such as Apigee).\nEvent Notification Configuration\nOnce you have the Webhook URL, you need to subscribe to the events that need to be notified. This can be done either through UI or API. For more details, see\nAdd Event Notification\nEvent Consumption\nOnce the setup is completed, the client can consume and process events data and use the data to configure actions to trigger. For more details see,\nConsuming event notification\nAt present notification the following event notifcations can be configured:\nrewardIssued\n: Notification that a reward has been issued to a customer.\nstreakCustomerUnEnrolment\n: Notification that a customer has been unenrolled from a streak program.\nissueRewardFailure\n: Notification that there was a failure in issuing a reward.\nupdateRewardTransaction\n: Notification that there was a reward transaction which is updated.\nnotInterestedBillAdded\n: Notification that a bill has been added under the 'not interested' category.\ngroupUpdated\n: Notification that a customer group has been updated.\npromisedToCurrentPointsConversion\n: Notification of the conversion of promised points to current points.\npointsTransferredReceived\n: Notification that points transferred have been received by a customer.\ngroupCreated\n: Notification that a new customer group has been created.\npartnerProgramUpdated\n: Notification that a partner program has been updated.\npointsIssued\n: Notification that points have been issued to a customer.\nsupplementaryMembershipExpiryReminder\n: Reminder that a supplementary membership is about to expire.\ntargetCustomerEnrolment\n: Notification that a customer has been enrolled in a target program.\nunifiedTargetsUnAchieved\n: Notification that unified targets have not been achieved.\npartnerProgramDelinked\n: Notification that a partner program has been delinked.\nbadgeEarned\n: Notification that a customer has earned a badge.\ncartPromotionIssued\n: Notification that a cart promotion has been issued.\nrewardCreated\n: Notification that a reward has been created.\nmanualPointsAdjustment\n: Notification that there has been a manual adjustment to points.\nredeemedPointsReversed\n: Notification that redeemed points have been reversed.\ncartPromotionEarned\n: Notification that a cart promotion has been earned.\ntierDowngraded\n: Notification that a customer has been downgraded to a lower tier.\npointsTransferredInitiated\n: Notification that a points transfer has been initiated.\ntierUpgraded\n: Notification that a customer has been upgraded to a higher tier.\nloyaltyCustomerMerge\n: Notification that loyalty accounts have been merged.\npartnerProgramLinked\n: Notification that a partner program has been linked.\nrequestUpdated\n: Notification that a request has been updated.\npromotionIssued\n: Notification that a promotion has been issued.\ntargetPeriodStarted\n: Notification that a target period has started.\npointsExpiryChange\n: Notification that the points expiry date has changed.\npointsExpired\n: Notification that points have expired.\nunifiedTargetsAchieved\n: Notification that unified targets have been achieved.\nrewardUpdated\n: Notification that a reward has been updated.\ntransactionUpdated\n: Notification that a transaction has been updated.\ncustomerAdded\n: Notification that a new customer has been added.\ngroupMemberRemoved\n: Notification that a member has been removed from a group.\ntargetValueAchieved\n: Notification that a target value has been achieved.\nsinglePointsExpiryUpdated\n: Notification that the expiry date of single points has been updated.\nalternateCurrenciesIssued\n: Notification that alternate currencies have been issued.\ntransactionRejected\n: Notification that a transaction has been rejected.\ntierDowngradeReminder\n: Reminder that a customer is about to be downgraded to a lower tier.\nissuedPointsReversed\n: Notification that issued points have been reversed.\ngroupMemberAdded\n: Notification that a member has been added to a group.\npointsContributionToGroup\n: Notification that points have been contributed to a group.\nstreakLevelUnAchieved\n: Notification that a streak level has not been achieved.\nCouponRedeem\n: Notification that a coupon has been redeemed.\npromotionEarned\n: Notification that a promotion has been earned.\nretroBillAdded\n: Notification that a retro bill has been added.\npointsExpiryReminder\n: Reminder that points are about to expire.\npointsRedeemed\n: Notification that points have been redeemed.\ncartPromotionRevoked\n: Notification that a cart promotion has been revoked.\ntransactionAdded\n: Notification that a new transaction has been added.\nrejectedTransactionRetrigger\n: Notification that a rejected transaction has been retriggered.\nstreakCustomerEnrolment\n: Notification that a customer has been enrolled in a streak program.\nCouponIssue\n: Notification that a coupon has been issued.\nIssueBulkCoupon\n: Notification that bulk coupons have been issued by specifying the count under a series.\ntierRenewed\n: Notification that a customer’s tier has been renewed.\nstreakLevelAchieved\n: Notification that a streak level has been achieved.\ncardUpdated\n: Notification that a card has been updated.\ntargetAchievedValueUpdated\n: Notification that the achieved value of a target has been updated.\ncartPromotionRedeemed\n: Notification that a cart promotion has been redeemed.\ntargetValueUpdated\n: Notification that the value of a target has been updated.\ncustomerUpdated\n: Notification that customer details have been updated.\nissuedAlternateCurrenciesReversed\n: Notification that issued alternate currencies have been reversed.\nrequestWorkflowEvent\n: Notification of an event in the request workflow.\ntargetPeriodCompleted\n: Notification that a target period has been completed.\nThe above events are also referred to as transactional events, as each of these events is inherently transactional in nature.\nUpdated\n19 days ago\nAsk AI"
    ]
  },
  "https://docs.capillarytech.com/docs/power-bi-dashboards-integration-into-intouch": {
    "title": "Viewing Power BI Dashboards on Insights",
    "chunks": [
      "Viewing Power BI Dashboards on Insights\nIntroduction\nThe integration of Power BI dashboards into the Intouch Insights portal enables brands to visualise data through interactive and customizable reports. You can apply filters, explore metrics, and analyse data directly within the Intouch environment without switching platforms.\nFeatures\nThe key features of Power BI integration are:\nEmbedded Power BI dashboards\nView and interact with Power BI dashboards directly within the Insights portal.\nScoped workspace per organization\nAccess Power BI dashboards in organization-specific workspaces. Each brand is mapped to its own workspace to ensure data separation and security.\nMark reports as favourites\nMark frequently used or important Power BI reports as favorites. Use the\nFavorites\nfilter or section to quickly access these reports. The favorite status persists across sessions.\nConfigure organization-specific settings\nUse secure, organization-specific Power BI credentials and workspace configurations to manage access and data visibility.\nView dashboards in full screen\nExpand any embedded Power BI dashboard to full-screen mode for enhanced viewing. The expanded view retains essential Insights UI elements such as the top bar and sidebar.\nUse interactive controls\nInteract with embedded dashboards using native Power BI controls:\nFiltering: Apply filters to display only relevant data.\nSorting:  Reorder data within tables and charts based on defined parameters.\nSlicing: Segment and explore specific subsets of data for detailed insights.\nUse cases\nDisplaying reports with complex KPI conditions in Insights\nRequirement\nDisplay a report in Insights that uses key performance indicators (KPIs) based on complex conditions, such as calculating the number of active users during the 180 days from the reporting end date.\nSolution\nUse embedded Power BI dashboards in Insights to create reports based on complex KPIs that cannot be configured directly in Insights.\nReporting on custom fields in Insights\nRequirement\nCreate and display brand-specific reports in Insights to include data stored in custom fields, such as the number of customers who signed up for the loyalty program using a mobile device. Insights reports do not natively support reporting on custom fields.\nSolution\nUse Power BI dashboards integrated with Insights to create and display reports using data from custom fields.\nCustomizing report appearance\nRequirement\nCustomize the appearance of reports, such as font types, colors, and layout, that cannot be modified within the Insights UI.\nSolution\nLeverage Power BI’s design capabilities to apply custom fonts, colors, and visual theming that can be viewed within Insights.\nPrerequisites\nEnable Power BI in the organization and  connect to Insights\nTo enable and set up the connection, raise a ticket with the Capillary Product Support Team. Include these details in your request:\nOrganization ID\nOrganization name\nReporting requirements for the dashboard\nThis is a paid feature and is not available by default. For pricing information, contact the Product Team.\nViewing a Power BI dashboard report\nTo view a Power BI dashboards report, do the following:\nIn the Insights+ page, go to\nReports\n>\nPower BI reports.\nYou see a list of available Power BI reports for the organization.\nClick the Power BI report you want to view.\nYou see the Power BI report. Each report consists of graphical representation called visual.\n(Optional) Hover over each visual to see the\navailable interactions\n.\nNote\n: The filters and options to view the report vary based on the reporting requirements.\nThe following is a sample Power BI report available in Insights.\n📘\nFair usage policy\nThe number of times you can apply filters or refresh the dashboard is limited per hour, based on the organization's subscribed plan. For more information, contact the Capillary's Point of Contact.\nInteracting with visuals\nWhile viewing Power BI visuals embedded in Insights, you can interact with the data using supported actions. These actions appear when you hover over a visual.\nActions\nDescription\nCopy\nCopies the visual with a caption.\nFilters\nDisplays filters and slicers that affect the visual.\nFocus mode\nExpands the visual.\nMore Options > Export data\nExports the data in a preferred format.\nMore Options > Show as a table\nDisplays the data from the visual as a table.\nMore Options > Spotlight\nHighlights the visual on a report page.\nMore Options > Get insights\nExplores the data to find insights, such as anomalies and trends. This functionality is currently not supported.\nMore Options > Sort axis\nRearranges the order of elements displayed on the x-axis or y-axis of the visual.\nEditing a Power BI dashboard report\nTo request changes to a dashboard, such as updating KPIs, modifying dimensions, or adjusting filters, submit a ticket to the Capillary Product Support team with the specific changes required.\nLimitations\nAccess through Intouch only\n: Power BI dashboards can be viewed only within the Intouch platform.\nMobile view not supported\n: Dashboards are not optimized for viewing on mobile devices.\nNot accessible via Power BI portal\n: Embedded reports are not available directly through the Power BI web interface.\nEditing Reports in Insights:\nYou cannot edit Power BI reports directly within Insights. All edits must be made in Power BI and updated through JIRA tickets.\nFAQs\nWho can enable Power BI integration for an organization?\nThe Capillary Product Support Team (PST) can enable Power BI integration.\nWho can edit the Power BI integration settings?\nThe organisation Administrator or the brand manager can edit the integration settings.\nWhat if I need to update my Power BI credentials later?\nYou can edit and save updated credentials in the Power BI\nSettings\nsection. The system will revalidate the updated details.\nUpdated\nabout 2 months ago\nAsk AI"
    ]
  },
  "https://docs.capillarytech.com/docs/org-management": {
    "title": "Organization Management",
    "chunks": [
      "Organization Management\nManage user preference\nUse the user profile settings to customize how the InTouch portal appears when you sign in. You can choose your display language, set a default organization if you have access to more than one, and select the module that opens by default.\nChange user profile preferences\nTo chnage your preferences,\nLog in to the Capillary InTouch portal.\nClick the\nprofile icon\nin the top-right corner.\nThe profile menu appears.\nSelect your username to open the user profile.\nClick\nEdit\n.\nThe profile opens.\nIn the\nLanguage\ndropdown, select your preferred language for the current organisation.\nNote:\nYou can set a different language for each organisation.\nIf you have access to multiple organizations, in the\nPreferred Organization\ndrop-down, select the default organization that appears after you sign in.\nIn the\nPreferred Module\ndrop-down list, select the module you want to open by default when signing in.\nNote:\nThis setting applies across all organizations you have access to..\nClick\nSave Changes\n.\nLog out and log back in for the changes to take effect.\nCreate or modify organization profile information\nCapillary admin users set up your organization in the Capillary InTouch platform and create admin users for your organization. These admin users can modify the organization's information such as profile details, time zone, currency, language, country, and much more. This section helps you to create/modify your organization's information based on valid data.\nAccess organization profile page\nTo access the organization profile page, follow these steps.\nLog on to InTouch of your cluster (India/US/EU/APAC2)\nClick the\nProfile\nicon and then click\nOrganization Settings\n.\nThe category expands as shown below.\nClick\nOrganization Profile\n. You will see the following page.\nClick the\nEdit\nbutton to modify the profile information. You will see the following page.\nOrganization Profile tab\nIn this tab, you can edit or select the profile information of an organization. Configure all the information with valid data such as address, starting month of the fiscal year, website URL, logo URL, and location of the organization.\n📘\nNote\nOrganization Name is selected by default. To change org name, contact the access team.\nTo create/modify the organization’s profile information, follow these steps.\nIn\nAddress\n, enter the geographical address of the organization. This is usually the address of the headquarter or the home branch of an organization.\nIn\nFiscal Year Start\n, select the starting month of the fiscal year using the drop-down list. A fiscal year can start from April or January depending on organization terms and conditions.\nIn\nOrg Website\n, enter the valid web address of the organization.\nIn\nOrg Logo\n, enter the valid URL of the organization’s logo.\nIn\nOrg Locale\n, select the user interface language for InTouch and other Capillary products using the drop-down list. You can configure the user interface language of Capillary applications InTouch by selecting the option, en_US (US English), or zh_CH (Chinese).\nClick\nSubmit\n.\nSet Org TimeZone tab\nThis tab lets you set the organization’s default and supported time zones.\n📘\nThe base time zone is the time zone of the headquarter or the home branch of the organization. All reporting and data are saved in the Capillary system with the base time zone.\nTo\ncreate/modify\nthe organization’s time zone, follow these steps.\nIn\nTime Zone\n, select each time zone that the organization supports and click add. To remove a selected time zone,  select the time zone from the {right box} and click remove.\nIn\nBase Time Zone\n, select the base time zone from the drop-down list.\nClick\nSubmit\n.\nOrg Currency tab\nIn this tab, you can configure the currency information of an organization using a currency data list.\n📘\nAll the transactional information gets converted into the base currency. Capillary shows reporting (where the currency is involved) in the base currency of an organization.\nTo create/modify supported currencies of the organization, follow these steps.\nIn\nCurrency Available\n, select each supported currency from the list, and click add. To remove a selected currency, select the currency from the right box, and click remove.\nIn\nBase Currency\n, select the base currency from the drop-down list.\n📘\nSteps to enable currency conversion for an organization:\nEnable currency conversion with CONF_CURRENCY_CONVERSION_ENABLE on the Billing Configuration page.\nAdd all base currency and supported currencies for the org as mentioned here (Set Org Currency Tab).\nAdd base currencies to stores as mentioned in Setup Organization Hierarchy.\nUpdate currency conversion ratio for the base currency and supported currencies either through the /v2/currencyratio API or Org Currency Ratio profile (Import Framework).\nIn\nDecimal Places for Base Currency\n(CONF_DECIMAL_PLACES_FOR_BASE_CURRENCY), set the appropriate decimal places for the currency using the drop-down list. This configuration determines the number of decimal places allowed for the base currency. You can set it to a maximum of 3 decimal places. For example, if you configure it to 2 decimal places and a transaction value is 100.567, the system will round it to 100.57 and store it in the database. If set to 0 decimal places, the value will be rounded to 101.\nNote: Currencies like Kuwaiti Dinar and Jordanian Dinar support up to 3 decimals; many currencies like the US dollar and European Pound support up to 2 decimal places; whereas, Ariary (Currency of Madagascar) does not support any decimal.\nNote:\nThis is also applicable for line-item level transactional values.\nClick\nSubmit\n.\nOrganization Languages/Countries tab\nIn this tab, you can configure the language, base language, country, base country, and other country information of the organization. You can use languages to create custom fields and store their values in your preferred language if required.\n📘\nThe language that is used by the headquarter or the home branch of an organization is considered as a base language.\nThe base country is usually where the home branch of the organization is located and supported countries are those in which the organization operates its business. When registering a customer, the mobile number of a customer is validated first with the base country and then with the supported countries.\nTo create/modify supported languages and countries of the organization, follow these steps.\nIn\nLanguage Available\n, select each supported language from the list, and click add. To remove a selected language,  select the language from the right box, and click remove.\nIn\nBase Language\n, select the base language using the drop-down list.\nIn\nCountries Available\n, select each supported country from the list and click add.\nSupported countries are those in which the organization is operating its business or supports customers to enroll in the loyalty program. When registering a customer in the organization, our system validates whether the mobile number provided matches with the Regex (regular expression) of any of the supported countries or the base country. To remove a selected country,  select the country from the right box, and click\nremove\n.\nIn\nBase Country\n, select the base country using the drop-down list. By default, the base country is considered for registering customers.\nCheck\nInclude other Country\nto support registering customers from any country irrespective of base or available countries set on this page.\nClick\nSubmit\n.\nParent Organization Setup tab\nIn this tab, you can set the parent organization for a child organization. Leave the option to default for a parent organization.\nTo create/modify the parent organization for the profile, follow these steps.\nIn\nSelect Parent Organization\n, select the organization name from the drop-down list.\nClick\nSubmit\n.\nOrganization Point of Contact tab\nIn this tab, you can select Capillary’s point of contact(s) for the organization. These POCs can monitor and manage the organizational account and associated products.\nTo create/modify the point of contact, follow these steps.\nIn\nCapillary POC\n, select the contacts from the list that you want to add, and click add. To remove a selected contact,  select the contact from the {right box} and click remove.\nClick\nSubmit\n.\nSocial tab\nIn this tab, you can edit the social media platform URLs of the organization.\nTo create/modify social media URLs, follow these steps.\nFor\nTwitter, Facebook, Google +, LinkedIn, RSS, Foursquare, Yelp!, Flickr\n, enter the valid URLs of the social media platforms required.\nClick\nSubmit\n.\nTo create/modify social media URLs, follow these steps.  For Twitter, Facebook, Google +, LinkedIn, RSS, Foursquare, Yelp!, Flickr, enter the valid URLs of the social media platforms required. Click Submit.\nThis topic provides information to admin users on how to modify their profile information and change the language for their InTouch account.\nEven though there is a language setting option at an organization level, admin users are provided with a privilege to see the Capillary applications of their account in the language they prefer.\nFor example, if your organization's language is set to Chinese and for your account, as an admin user), the language is set to English, then you will see the applications of your account in English irrespective of your organization's language. However, only admin users have this privilege.\nTo modify your profile information and language:\nLog on to InTouch of your cluster (India/US/EU/APAC2)\nClick the\nSettings\nicon and then click\nOrganization Setup\n. The category expands showing the available options.\nClick\nAdministrative Users\n. You will see the Admin Users page as shown below\nScroll down to your account and click the respective Edit  option. You will see the profile information.\nModify the fields as required and click Create. The purpose for each option is provided in the following table.\nOPTION\nPURPOSE\nTitle\nAddressing the user (Mr./Mrs./Miss.)\nFirst Name\nFirst name of the user\nMiddle Name\nMiddle name of the user\nLast Name\nLast name of the user\nMobile\nMobile number of the user\nEmail\nEmail id of the user\nUser Role\nDesignation/Access level of the user\nUser Locale\nDefault Language of all the UI elements of Capillary applications for the user.\nUpdated\nabout 2 months ago\nAsk AI"
    ]
  },
  "https://docs.capillarytech.com/reference/transaction": {
    "title": "Transaction (V1)",
    "chunks": [
      "Ask AI\nTransaction (V1)\nA transaction represents a purchase or return event. Based on the customers’ loyalty status, transactions are categorized into three types.\nLoyalty Transactions\n: Transactions made by registered customers of your organization’s loyalty program. A customer can be tagged to a loyalty transaction.\nNon-loyalty Transactions\n: Transactions made by customers who are not registered into your loyalty program, but subscribed their mobile number or email id with the organization. These transactions are tagged to the respective identifiers (mobile no/email id)\nNot-interested Transactions\n: Transactions made by customers who are not interested to register into your organization’s loyalty program. These transactions are also considered as anonymous transactions.\nTransactions are again classified into the following types:\nRegular\n: Normal transactions made at the PoS. Regular transactions could be loyalty, non-loyalty and not-interested.\nReturn\n: Transactions that are returned at the PoS. Return transactions need an identifier reference. Hence, only loyalty and non-loyalty transactions can be returned through APIs. See Transaction Return API for more details.\nMixed\n: A transaction that involves both regular and return is termed as mixed transaction.\nThe transaction entity contains all the necessary APIs to manage transactions and retrieve transaction details. The transaction entity stores regular/return transactions, points/coupons redeemed against transactions, retro transactions (converting not interested transactions to loyalty), extended fields, and custom fields.\nFor information on how the system handles different timezones, see\nHandling different timezone\n.\n📘\nExtended fields and custom fields in transactions are used to capture additional information of a transaction or transaction line-item. The extended fields are predefined defined in the system with specific values, whereas, custom fields can have any name and value as required for the org.\nPrerequisites\nBefore using transaction APIs, understand the transaction configurations of your organization. You can see the transaction related settings on InTouch > Settings > Systems & Deployment > InTouch PoS Configuration > Billing.\nMandatory parameters required to submit a transaction\nWhether Retro Transaction is enabled to convert not-interested transactions to regular transactions and the maximum duration for which retro transaction is allowed\nWhether Authorization is required for retro transactions\nWhether Transaction Return is enabled for your organization (for transaction returns)\nScope of transaction numbers to be unique (store level or TILL level) and duration for which repetition is not allowed (20 days, 30 days etc.)\nMaximum and minimum amount allowed per transaction\nMaximum and minimum amount allowed per line-item\n📘\nIgnore error headers. It is still in the evaluation phase.\nStatus Codes\nSuccess Codes\nCode\nDescription\n600\nTransaction added successfully.\nTransaction retrieved successfully.\nTransaction updated successfully.\n1630\nTransaction marked as regular through Retro conversion. Transaction added successfully.\nError Codes\nCode\nDescription\n500\nUnable to retrieve transaction.\n517\nRate limit exceeded for that specific user.\n601\nTransaction failed. Transaction amount, quantity, rate, or discount is invalid.\n602\nTransaction number is invalid.\n603\nPoints are already used (Deprecated).\n604\nTransaction number already exists.\n605\nInvalid transaction type. Only regular, return and not-interested transaction types are supported.\n606\nCustomer identifier is not passed. Please enter customer's mobile or email or external id to process.\n607\nNo transaction id passed. Please pass the transaction id to process.\n608\nUnable to add transaction.\n609\nUpdate failed. Please verify all the fields.\n610\nUnable to register. Please verify all the fields.\n611\nCustomer not found.\n614\nTransaction is already cancelled.\n615\nTransaction details are not passed.\n616\nItem code already exists.\n617\nInvalid attribute for the item.\n618\nCustomer is marked as fraud.\n619\nTransaction id is not provided.\n620\nTransaction id is invalid.\n621\nTransaction date is invalid. Transaction date should be within the accepted past or future date range limit.\n622\nUnable to add line-item.\n623\nUnable to trigger other related events for the transaction.\n624\nUnable to process return-transaction. You can make a return only after adding a transaction.\n625\nTransaction number does not exist.\n626\nUnable to return transaction. The quantity of returned items are more than purchased items.\n627\nQuantity cannot be negative.\n628\nInvalid return transaction type.\n629\nThe return quantity of the item is more than available quantity.\n630\nThe return amount is more than the transaction/line-item amount.\n631\nTransaction amount cannot be negative.\n632\nCannot return the transaction with return type LINE_ITEM because the type AMOUNT has already been used for returning the same transaction.\n633\nThe entire transaction is already returned.\n634\nThis transaction is already returned.\n635\nCannot return the transaction with the return type AMOUNT because the type LINE_ITEM has been used for returning the same transaction.\n636\nThe transaction is already returned with the return type as LINE_ITEM. You can process return for other items only with return type LINE_ITEM.\n637\nUnable to revert points issued to the customer (for return transaction). Please try again later.\n638\nUnable to return transaction. The transaction is already returned with type LINE_ITEM. Hence, you cannot use the type AMOUNT for the same transaction.\n639\nUnable to return full transaction. A part of the transaction or complete transaction is already returned.\n640\nPoints or coupons are not redeemed for this transaction.\n641\nNo customer found.\n642\nRedemption failed. An error occurred in points/coupon redemption.\n643\nInvalid transaction. The transaction date exceeds the accepted future date limit.\n644\nInvalid transaction. The transaction date cannot be less than the accepted past date limit.\n645\nTransaction addition failed for not interested.\n646\nCustomer registration failed. The email id is invalid.\n647\nCustomer registration failed. Email id is already assigned to another customer.\n648\nCustomer registration failed. Mobile number is already assigned to another customer.\n649\nCustomer registration failed. Mobile number is invalid.\n650\nCustomer registration failed. Mobile number is not accepted as a unique identifier.\n651\nCustomer registration failed. Mobile number is required for registration.\n652\nCustomer registration failed. Mobile number/email id/external id is invalid.\n653\nCustomer registration failed. External id is already assigned to another customer.\n654\nCustomer registration failed. External id is not accepted as a unique identifier.\n655\nCustomer registration failed. Customer is not registered in loyalty program.\n656\nNo customer found.\n657\nCustomer registration failed. Registration in EUP failed.\n658\nCustomer registration failed. Only email id is not sufficient for registration.\n659\nCustomer registration failed. Please enter email id to register.\n660\nCustomer registration failed. Registration date exceeds the accepted past or future date limit.\n661\nAmount of the line-item amount cannot be negative.\n662\nValue of a line cannot be negative.\n663\nRate of a line-item cannot be negative\n664\nDiscount of a line-item cannot be negative.\n665\nGross amount of the transaction cannot be negative.\n666\nDiscount cannot be negative.\n667\nUnable to find the transaction ID for this customer.\n668\nUnable to find the transaction number for this customer.\n669\nUnable to update custom field.\n670\nTransaction id/number is not provided.\n671\nInvalid Store or TILL code.\nInvalid category code.\n672\nBatch limit exceeded.\n673\nReturning of transactions is not allowed.\n674\nReturning of line item is not allowed.\n675\nReturning of transaction amount is not allowed.\n676\nReturning of a complete transaction amount is not allowed.\n677\nUnable to process. Please enter a transaction number for returning a transaction.\n678\nAmount of returned item is more than purchased item.\n679\nLine-item(s) to be returned is not specified.\n680\nNo transactions of the specific customer were found.\n681\nTransactions are blocked for this customer.\n682\nCurrency conversion is disabled for the org.\n683\nFailed to call new bill event EMF.\n684\nFailed EMF new bill DVS event.\n685\nField length too long.\n686\nUnable to add transaction.\n687\nPoints activities are queued and will be updated later.\nItem code\nmerge is not supported.\n688\nNo matching line-item found for return.\nTransaction number not found.\n689\nPoints processing failed\n690\nPoints processing failed\n691\nPoints processing failed\n692\nPoints processing failed\n693\nPoints processing failed\n694\nPoints processing failed\n695\nInvalid configuration. Please report to the Capillary Support.\n696\nPoints processing failed\n697\nPoints processing failed\n698\nPoints processing failed.\n699\nInvalid configuration. Please report to the Capillary Support.\n710\nReturn bill event failed from EMF.\n820\nCurrent operation is not allowed. The customer is marked as fraud.\n1101\nInvalid loyalty program ID passed.\n1102\nInvalid currency conversion ratio passed.\n1103\nInvalid shipping store code passed.\n1623\nTransaction type is invalid.\n1624\nInsufficient parameters passed to fetch transaction.\n1625\nTarget type is not specified.\n1626\nThe requested transaction type cannot be changed.\n1627\nThe transaction is already marked as retro.\n1628\nTransaction id is invalid\n1629\nClient signature is required to perform this action\n1631\nRetro transaction is not enabled for your organization\n1632\nRegistration date is too older than the transaction date. See the retro configuration set for your organization\n1633\nThe duration between registration and transaction mapping exceeds the limit set\n1634\nReturn type is invalid\n1635\nPlease pass line-items that need to be returned\n1636\nTransaction status is invalid\n9601\nFailed to add line-item.\n9602\nFailed to add credit notes.\n9603\nFailed to add payment more details (tender).\n9604\nFailed to add custom fields\n9605\nBase currency is not set for the org.\n9606\nCurrency not passed for the transaction.\n9607\nPayment mode (tender) not found.\n9608\nLine-item with the item code\npassed is marked as outlier.\n9609\nInvalid payment attribute passed.\n9610\nNew bill event failed. Points are not awarded.\n9611\nTransaction is marked as outlier.\n9612\nUnable to save credit notes.\n9613\nInvalid payment attribute.\n9614\nMultiple loyalty bills found to be returned.\n9615\nValidity (in days) for return policy is not defined.\n9616\nSingle loyalty bill found. Allowing regular return."
    ]
  }
}